
For Grep -c

Example#1
```
[r2he@ieng6-203]:skill-demo1:188$ grep -c 11 technical/biomed/1468-6708-3-1.txt
1
```
;;
Example#2
```
[r2he@ieng6-201]:~:193$ cd skill-demo1
[r2he@ieng6-201]:skill-demo1:194$ grep -c and technical/biomed/1468-6708-3-7.txt
58
```

Example#3
```
[r2he@ieng6-201]:skill-demo1:195$ grep -c in technical/biomed/1468-6708-3-7.txt
167
```

For Grep -a

Example#1
```
[r2he@ieng6-203]:skill-demo1:188$ grep -c 11 technical/biomed/1468-6708-3-1.txt
1
```

Example#2
```
[r2he@ieng6-201]:skill-demo1:207$ grep -a 188 technical/biomed/1468-6708-3-7.txt
          Between 1966 and 2001, there were 188 published
```

Example#3
```
[r2he@ieng6-201]:skill-demo1:208$ grep -a 12 technical/biomed/1468-6708-3-7.txt
          weight information reported by Ruoff [ 12 ] . Withdrawal
```
For Grep -o

Example#1
```
[r2he@ieng6-201]:skill-demo1:214$ grep -o two technical/biomed/1468-6708-3-7.txt
two
two
```
Example#2
```
[r2he@ieng6-201]:skill-demo1:216$ grep -o years technical/biomed/1468-6708-3-7.txt
years
years
years
years
```

Example#3
```
[r2he@ieng6-201]:skill-demo1:218$ grep -o data technical/biomed/1468-6708-3-7.txt
data
data
data
data
data
data
data
```